old-zets/Posts/PeoplesProblem.md

# Table of Contents

1.  [The fallacious concept: `minorities`](#orgdee0b5c)
    1.  [Historical examples of contraditions minority-schemes](#org340d61e)
    2.  [Racism in LGBTQ+ groups?](#orgd3661ce)
    3.  [LGBTQ+ phobia in black groups?](#orgcd3acf3)
2.  [All resources:](#org8f07d40)

It&rsquo;s said *divide and conquer* is one of the oldest tricks in the book.
Certainly, it haven&rsquo;t gone out of style.

> Tradition attributes the origin of the motto to Philip
>   II of Macedon: Greek: διαίρει καὶ
>   βασίλευε diaírei kài basíleue, in Ancient Greek,
>   meaning &ldquo;divide and rule&rdquo;.

> Divide and rule policy (Latin: divide et impera), or
> divide and conquer, in politics and sociology is
> gaining and maintaining power by breaking up larger
> concentrations of power into pieces that individually
> have less power than the one implementing the
> strategy.

-   Quotes from: <https://en.wikipedia.org/wiki/Divide_and_rule>


<a id="orgdee0b5c"></a>

# The fallacious concept: `minorities`

> A partition of objects into groups is one of the
> possible ways of subdividing the objects into groups ().
> 
> The rules are: the order in which objects are
> assigned to a group does not matter; each object can
> be assigned to only one group.

-   Source: Partitions into groups, Marco Taboga, PhD.

For every class, or set, given that there are $n$ distinct elements, one can
form a huge number of possible partitions with them ([Known as Bell Numbers](https://wikiless.org/wiki/Bell_number?lang=en)).
Here is a short table mapping for each group formed of $n$ people, how many
partitions (subgroups) can be formed.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right"><code>n</code> people</th>
<th scope="col" class="org-right">possible groups</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-right">5</td>
</tr>


<tr>
<td class="org-right">4</td>
<td class="org-right">15</td>
</tr>


<tr>
<td class="org-right">5</td>
<td class="org-right">52</td>
</tr>


<tr>
<td class="org-right">6</td>
<td class="org-right">203</td>
</tr>


<tr>
<td class="org-right">7</td>
<td class="org-right">877</td>
</tr>


<tr>
<td class="org-right">8</td>
<td class="org-right">4140</td>
</tr>


<tr>
<td class="org-right">(&#x2026;)</td>
<td class="org-right">(&#x2026;)</td>
</tr>
</tbody>
</table>

Therefore, for the same group of people, let&rsquo;s say, **8** of them, you could form
**4140** possible subgroup-partition schemes! This concept is extremely important
to be grasped. Because, these numbers are so astronomical and they signal the
following: reasoning based on **group-partitioning** are essentially flawed, out
of any context.

Any opinion can be held about groups, once we can form an
astronomical quantity of them, and surely one of these possible partitioning
will fit our biased description of reality.

Finally, at least half (this proportion increases as the $n$ increases) of all
possible groupings are of **minority**-partitioning schemes.


<a id="org340d61e"></a>

## Historical examples of contraditions minority-schemes

In 03 February 2022, today, it&rsquo;s not outrageous to say that the
**LGBTQ+**-movement and the **Black**-movement are two of the greatest
**minority-based** movements there are. One, lead by group-thinking, might believe
that *clashes* or *frictions* between them to be exceptions. For, they both are
`minority` groups. Although, faced by the reality that, even when we deal with
small groups, there are no *possible* one, unifying, partition-rule that
characterize them. Therefore, all kinds of **unaccounted** behavior follow from
the great variate of subgroups possible in a group.

We know look at examples of **unaccounted** behaviors arising amongst minority
groups. Movements, itself, that appear antagonist and improbable, if we depart
from the minority-group hypothesis.


<a id="orgd3661ce"></a>

## Racism in LGBTQ+ groups?

<https://www.nbcnews.com/nbc-out/out-news/human-rights-campaigns-first-black-leader-sues-firing-alleging-racial-rcna14726>


<a id="orgcd3acf3"></a>

## LGBTQ+ phobia in black groups?


<a id="org8f07d40"></a>

# All resources:

-   <https://en.wikipedia.org/wiki/Divide_and_rule>
-   <https://wikiless.org/wiki/Bell_number?lang=en>
-   <https://www.nbcnews.com/nbc-out/out-news/human-rights-campaigns-first-black-leader-sues-firing-alleging-racial-rcna14726>

